Public Attributes | List of all members
API_GetPointType Struct Reference
User input management
Parameters of the point input operation. More...
#include <APIdefs_Interface.h>
 Public Attributes
char  | prompt [256]
[in] Prompt string to be displayed in the control box during input
bool  | changeFilter
[in] Use the filter field for filtering neigs during input
bool  | changeCursorSet
[in] Use the cursorSet field for changing cursor forms
bool  | changePlane
[in] Use the planeCoord and planeNormal fields for defining input plane
bool  | enableQuickSelection
[in] Enabling Quick Selection (magnetic cursor)
API_NeigFilter  | filter
[in] Neig filter for cursor snapping. See ACAPI_UserInput_InitNeigFilter
API_CursorSet  | cursorSet
[in] Cursor set for customized visual feedback
API_Coord3D  | planeCoord
[in] A point of the input plane
API_Vector3D  | planeNormal
[in] The normal vector of the input plane
API_Coord3D  | pos
[out] The coordinate of the clicked point
API_Neig  | neig
[out] The neig found at the clicked point
API_Guid  | guid
[out] Guid of the clicked element.
Int32  | dbElemIdx
[out] Database elem index of the clicked element.
Int32  | bodyIdx
[out] Index of the clicked body in the clicked element.
ULong  | ipgon
[out] Index of the clicked polygon in the clicked body.
Detailed Description
Parameters of the point input operation.
Remarks
For the utilization of API_GetPointType see the ACAPI_UserInput_GetPoint function.
Member Data Documentation
◆ bodyIdx
 API_GetPointType::bodyIdx
[out] Index of the clicked body in the clicked element.
◆ changeCursorSet
 API_GetPointType::changeCursorSet
[in] Use the cursorSet field for changing cursor forms
◆ changeFilter
 API_GetPointType::changeFilter
[in] Use the filter field for filtering neigs during input
◆ changePlane
 API_GetPointType::changePlane
[in] Use the planeCoord and planeNormal fields for defining input plane
◆ cursorSet
 API_GetPointType::cursorSet
[in] Cursor set for customized visual feedback
◆ dbElemIdx
 API_GetPointType::dbElemIdx
[out] Database elem index of the clicked element.
◆ enableQuickSelection
 API_GetPointType::enableQuickSelection
[in] Enabling Quick Selection (magnetic cursor)
◆ filter
 API_GetPointType::filter
[in] Neig filter for cursor snapping. See ACAPI_UserInput_InitNeigFilter
◆ guid
 API_GetPointType::guid
[out] Guid of the clicked element.
◆ ipgon
 API_GetPointType::ipgon
[out] Index of the clicked polygon in the clicked body.
◆ neig
 API_GetPointType::neig
[out] The neig found at the clicked point
◆ planeCoord
 API_GetPointType::planeCoord
[in] A point of the input plane
◆ planeNormal
 API_GetPointType::planeNormal
[in] The normal vector of the input plane
◆ pos
 API_GetPointType::pos
[out] The coordinate of the clicked point
◆ prompt
 API_GetPointType::prompt
[in] Prompt string to be displayed in the control box during input